In [161]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings("ignore")

#website: https://insideairbnb.com/get-the-data/?utm_source=chatgpt.com

In [163]:
df = pd.read_csv("listings.csv")
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,number_of_reviews_ltm,license
0,13913,Holiday London DB Room Let-on going,54730,Alina,NaN,Islington,51.56861,-0.11270,Private room,70.0,1,55,2025-08-21,0.30,2,331,10,NaN
1,15400,Bright Chelsea Apartment. Chelsea!,60302,Philippa,NaN,Kensington and Chelsea,51.48780,-0.16813,Entire home/apt,149.0,4,97,2025-04-05,0.51,1,199,1,NaN
2,17402,Very Central Modern 3-Bed/2 Bath By Oxford St W1,67564,Liz,NaN,Westminster,51.52195,-0.14094,Entire home/apt,411.0,3,56,2024-02-19,0.32,2,80,0,NaN
3,24328,Battersea live/work artist house,41759,Joe,NaN,Wandsworth,51.47072,-0.16266,Entire home/apt,NaN,7,95,2025-07-05,0.53,1,294,1,NaN
4,36274,Bright 1 bedroom apt off brick lane in Shoreditch,133271,Hendryks,NaN,Tower Hamlets,51.52322,-0.06979,Entire home/apt,210.0,5,15,2025-09-06,0.09,2,323,6,NaN

In [164]:
# Data Quality check 

df = pd.read_csv("listings.csv")

def data_quality_summary(df):

    #Shape of the dataset
    print("\nData shape")
    print(df.shape)

    #Data Type
    print("\nData Type")
    print(df.dtypes)
    
    #Missing values (%)
    print("\nMissing values (%)")
    print((100*df.isna().sum().sort_values(ascending = False))/len(df))

    #Duplicate values
    print("\nDuplicate values")
    print(df.duplicated().sum())

    #Data Description
    print("\nData Desctiption")
    print(df.describe())

data_quality_summary(df)

Data shape
(96871, 18)

Data Type
id                                  int64
name                               object
host_id                             int64
host_name                          object
neighbourhood_group               float64
neighbourhood                      object
latitude                          float64
longitude                         float64
room_type                          object
price                             float64
minimum_nights                      int64
number_of_reviews                   int64
last_review                        object
reviews_per_month                 float64
calculated_host_listings_count      int64
availability_365                    int64
number_of_reviews_ltm               int64
license                           float64
dtype: object

Missing values (%)
license                           100.000000
neighbourhood_group               100.000000
price                              36.035552
last_review                        24.901157
reviews_per_month                  24.901157
host_name                           0.044389
host_id                             0.000000
neighbourhood                       0.000000
latitude                            0.000000
longitude                           0.000000
room_type                           0.000000
name                                0.000000
minimum_nights                      0.000000
number_of_reviews                   0.000000
calculated_host_listings_count      0.000000
availability_365                    0.000000
number_of_reviews_ltm               0.000000
id                                  0.000000
dtype: float64

Duplicate values
0

Data Desctiption
                 id       host_id  neighbourhood_group      latitude  \
count  9.687100e+04  9.687100e+04                  0.0  96871.000000
mean   6.894448e+17  2.144494e+08                  NaN     51.509740
std    5.941222e+17  2.196053e+08                  NaN      0.049067
min    1.391300e+04  2.594000e+03                  NaN     51.295937
25%    3.026058e+07  2.726814e+07                  NaN     51.484150
50%    8.505248e+17  1.164321e+08                  NaN     51.513720
75%    1.254262e+18  4.198974e+08                  NaN     51.539108
max    1.508964e+18  7.186905e+08                  NaN     51.682630

          longitude         price  minimum_nights  number_of_reviews  \
count  96871.000000  6.196300e+04    96871.000000       96871.000000
mean      -0.127638  2.299170e+02        5.440297          21.657627
std        0.101112  4.437589e+03       23.686681          50.368644
min       -0.496760  7.000000e+00        1.000000           0.000000
25%       -0.189468  7.700000e+01        1.000000           1.000000
50%       -0.127505  1.350000e+02        2.000000           5.000000
75%       -0.068316  2.210000e+02        4.000000          20.000000
max        0.278960  1.085147e+06     1125.000000        1902.000000

       reviews_per_month  calculated_host_listings_count  availability_365  \
count       72749.000000                    96871.000000      96871.000000
mean            0.990334                       16.685499        144.927429
std             1.304282                       53.130290        141.808279
min             0.010000                        1.000000          0.000000
25%             0.150000                        1.000000          0.000000
50%             0.520000                        2.000000         96.000000
75%             1.290000                        8.000000        288.000000
max            36.960000                      500.000000        365.000000

       number_of_reviews_ltm  license
count           96871.000000      0.0
mean                5.709614      NaN
std                11.996770      NaN
min                 0.000000      NaN
25%                 0.000000      NaN
50%                 0.000000      NaN
75%                 6.000000      NaN
max               390.000000      NaN

In [166]:
#converting to date and counting NaT rows

df["last_review"] = pd.to_datetime(df["last_review"].str.replace("$", ""), dayfirst = True, errors="coerce") #coerce will convert not convertible values to NaT (Not a Time)
NaT = df["last_review"].isna().sum()
print(NaT)

24122

In [184]:
# Number out outliers by price

Q1 = df["price"].quantile(0.25)
Q3 = df["price"].quantile(0.75)
IQR = Q3 - Q1

outliers = df[(df["price"] < Q1 - 1.5 * IQR) | (df["price"] > Q3 + 1.5 * IQR)]

print(f"Outliers (%) ): {100*len(outliers)/len(df)}")

Outliers (%) ): 4.330501388444426

**Data Analysis**

In [188]:
#Number of hosts

Hosts = df["host_id"].nunique()

print(f"Totals hosts: {Hosts}")

Totals hosts: 55646

In [192]:
#Total Neighbourhood where Airbnbs are located

Count_Cities = df["neighbourhood"].nunique()

print(f"Total neighbourhoods: {Count_Cities}")

Total neighbourhoods: 33

In [196]:
#Neighbourhood where Airbnbs are located

Cities = df["neighbourhood"].unique()

print("Neighbourhoods")
print(Cities)

Neighbourhoods
['Islington' 'Kensington and Chelsea' 'Westminster' 'Wandsworth'
 'Tower Hamlets' 'Richmond upon Thames' 'Haringey'
 'Hammersmith and Fulham' 'Southwark' 'Barnet' 'Hounslow' 'Waltham Forest'
 'Brent' 'Camden' 'Hackney' 'Merton' 'Croydon' 'Lambeth' 'Havering'
 'Greenwich' 'Enfield' 'City of London' 'Ealing' 'Barking and Dagenham'
 'Lewisham' 'Newham' 'Hillingdon' 'Redbridge' 'Kingston upon Thames'
 'Bromley' 'Harrow' 'Bexley' 'Sutton']

In [200]:
# Room Types

Room = df["room_type"].unique()

print(f"Room Type: {Room}")

Room Type: ['Private room' 'Entire home/apt' 'Hotel room' 'Shared room']

In [31]:
# Avg price per room type

Avg_price_type = df.groupby(["room_type"], as_index = False).agg(avg_price=("price", "mean"))

Avg_price_type

         room_type   avg_price
0  Entire home/apt  279.347157
1       Hotel room  657.833333
2     Private room  121.713910
3      Shared room   96.910995

In [33]:
# Avg price of rooms in each neighbourhood

Avg_price_neighbourhood = (
                            df.groupby(["neighbourhood"], as_index = False)
                              .agg(avg_price=("price", "mean"))
                              .sort_values("avg_price", ascending=False)
                              .reset_index(drop=True)
)

Avg_price_neighbourhood

             neighbourhood   avg_price
0            Tower Hamlets  430.906199
1           City of London  354.389908
2                  Lambeth  345.710741
3              Westminster  342.139405
4   Kensington and Chelsea  336.072148
5                Islington  217.546807
6                   Camden  216.511547
7   Hammersmith and Fulham  199.188085
8               Wandsworth  198.431607
9     Richmond upon Thames  184.270936
10               Southwark  174.276880
11                   Brent  173.697866
12                 Hackney  161.126299
13                  Newham  154.640653
14               Greenwich  153.665918
15                Havering  152.423256
16                Hounslow  149.472687
17                  Merton  148.293388
18                  Ealing  140.480124
19                Haringey  139.162993
20                  Barnet  138.670133
21    Kingston upon Thames  138.426804
22                 Bromley  128.656761
23               Redbridge  128.199725
24                Lewisham  121.330959
25                 Enfield  120.100149
26                  Bexley  119.614919
27          Waltham Forest  117.312240
28                  Harrow  108.915767
29    Barking and Dagenham  108.563303
30              Hillingdon  108.551821
31                 Croydon  102.362563
32                  Sutton   96.848485

In [35]:
# Avg price for each room type in each neighbourhood
 
Avgprice_city_room = df.groupby(["neighbourhood", "room_type"], as_index = False).agg(avg_price = ("price", "mean"))
Avgprice_city_room

            neighbourhood        room_type    avg_price
0    Barking and Dagenham  Entire home/apt   164.198556
1    Barking and Dagenham     Private room    50.609023
2    Barking and Dagenham      Shared room   111.000000
3                  Barnet  Entire home/apt   165.381667
4                  Barnet       Hotel room          NaN
..                    ...              ...          ...
102            Wandsworth      Shared room   153.166667
103           Westminster  Entire home/apt   373.588714
104           Westminster       Hotel room  1088.454545
105           Westminster     Private room   155.258842
106           Westminster      Shared room   191.490566

[107 rows x 3 columns]

In [202]:
#Average availability throughout a year in each neigbourhood. 

Availability = (
                df.groupby(["neighbourhood"], as_index=False)
                  .agg(avg_availability=("availability_365", "mean"))
                  .sort_values("avg_availability")
                  .reset_index(drop=True)
)
Availability

             neighbourhood  avg_availability
0                  Hackney        101.109608
1                Islington        111.094519
2                  Lambeth        119.351830
3            Tower Hamlets        122.082742
4                Southwark        126.309954
5                 Haringey        126.898383
6               Wandsworth        130.701309
7                 Lewisham        131.793284
8     Richmond upon Thames        132.544961
9   Hammersmith and Fulham        135.436613
10          Waltham Forest        138.668031
11                  Merton        141.721935
12                  Camden        148.775149
13                   Brent        151.088771
14    Kingston upon Thames        154.614856
15                  Newham        157.941713
16  Kensington and Chelsea        158.802843
17                Hounslow        160.953731
18                  Ealing        162.650355
19             Westminster        164.098463
20               Greenwich        166.674286
21                  Barnet        174.089363
22                  Sutton        179.207547
23                 Bromley        185.578313
24                 Croydon        187.554455
25                 Enfield        192.330490
26                  Harrow        196.732036
27               Redbridge        198.314484
28          City of London        207.027322
29    Barking and Dagenham        210.814667
30              Hillingdon        214.901804
31                Havering        221.192748
32                  Bexley        227.353125

In [204]:
#Number of Airbnbs in each neighbourhood

No_Airbnbs = (
    df.groupby(["neighbourhood"])
      .agg(total_airbnbs=("price", "count"))
      .sort_values("total_airbnbs")
      .reset_index()  # keep neighbourhood as a column
)

No_Airbnbs

             neighbourhood  total_airbnbs
0                   Sutton            363
1                 Havering            430
2           City of London            436
3                   Harrow            463
4     Kingston upon Thames            485
5                   Bexley            496
6     Barking and Dagenham            545
7                  Enfield            669
8                  Bromley            673
9               Hillingdon            714
10               Redbridge            726
11    Richmond upon Thames            812
12                Hounslow            897
13                  Merton            968
14                 Croydon           1186
15          Waltham Forest           1201
16               Greenwich           1335
17                Haringey           1497
18                Lewisham           1544
19                  Ealing           1610
20                  Newham           1653
21                  Barnet           1731
22                   Brent           2062
23  Hammersmith and Fulham           2669
24               Islington           2756
25                 Lambeth           2821
26              Wandsworth           3012
27                 Hackney           3175
28               Southwark           3218
29           Tower Hamlets           4275
30                  Camden           4330
31  Kensington and Chelsea           4768
32             Westminster           8443

In [41]:
#We are assuming that guests gave review in the same month they stayed in an airbnb

avg_price_month = (
    df.groupby([df["last_review"].dt.to_period("M"), "room_type"])
      .agg(avg_price=("price", "mean"))
      .reset_index()
)

avg_price_month.rename(columns={"last_review": "month"}, inplace=True)

In [43]:
avg_price_month

       month        room_type   avg_price
0    2011-07     Private room         NaN
1    2012-03     Private room  781.000000
2    2012-05     Private room   41.000000
3    2012-07     Private room         NaN
4    2012-08  Entire home/apt         NaN
..       ...              ...         ...
357  2025-08      Shared room  152.920000
358  2025-09  Entire home/apt  201.010956
359  2025-09       Hotel room  198.000000
360  2025-09     Private room   69.559445
361  2025-09      Shared room   52.404255

[362 rows x 3 columns]

In [220]:
# For which month the prices are highest, lowest and what's the average in each neightbourhood according to each room type

price_summary = (
    df.groupby(["neighbourhood", "room_type"])
      .agg(
          min_price=("price", "min"),
          max_price=("price", "max"),
          avg_price=("price", "mean")
      ).reset_index()
)
                                           
price_summary

            neighbourhood        room_type  min_price  max_price    avg_price
0    Barking and Dagenham  Entire home/apt       40.0      913.0   164.198556
1    Barking and Dagenham     Private room       18.0      350.0    50.609023
2    Barking and Dagenham      Shared room      100.0      122.0   111.000000
3                  Barnet  Entire home/apt       27.0     3500.0   165.381667
4                  Barnet       Hotel room        NaN        NaN          NaN
..                    ...              ...        ...        ...          ...
102            Wandsworth      Shared room       16.0      489.0   153.166667
103           Westminster  Entire home/apt       45.0    15143.0   373.588714
104           Westminster       Hotel room      188.0     1490.0  1088.454545
105           Westminster     Private room       18.0    10000.0   155.258842
106           Westminster      Shared room       13.0     1800.0   191.490566

[107 rows x 5 columns]

In [225]:
# This will display entire result

print(price_summary.to_string())

              neighbourhood        room_type  min_price  max_price    avg_price
0      Barking and Dagenham  Entire home/apt       40.0      913.0   164.198556
1      Barking and Dagenham     Private room       18.0      350.0    50.609023
2      Barking and Dagenham      Shared room      100.0      122.0   111.000000
3                    Barnet  Entire home/apt       27.0     3500.0   165.381667
4                    Barnet       Hotel room        NaN        NaN          NaN
5                    Barnet     Private room       21.0     4800.0    78.354717
6                    Barnet      Shared room       52.0       52.0    52.000000
7                    Bexley  Entire home/apt       45.0     4800.0   187.541833
8                    Bexley     Private room       18.0      265.0    50.024490
9                     Brent  Entire home/apt       36.0    30812.0   223.972536
10                    Brent     Private room       17.0     6309.0    98.646699
11                    Brent      Shared room       20.0       50.0    32.333333
12                  Bromley  Entire home/apt       45.0     6924.0   172.982500
13                  Bromley     Private room       22.0      808.0    63.779412
14                  Bromley      Shared room       45.0       45.0    45.000000
15                   Camden  Entire home/apt       43.0    15000.0   260.121116
16                   Camden       Hotel room       20.0      148.0    67.500000
17                   Camden     Private room       31.0     8000.0   101.043821
18                   Camden      Shared room       20.0      299.0    47.482759
19           City of London  Entire home/apt       83.0     9000.0   354.320312
20           City of London     Private room       53.0     3000.0   360.686275
21           City of London      Shared room       60.0       60.0    60.000000
22                  Croydon  Entire home/apt       29.0     6924.0   146.747913
23                  Croydon       Hotel room       79.0       79.0    79.000000
24                  Croydon     Private room       10.0      750.0    56.796233
25                  Croydon      Shared room       69.0      183.0   126.000000
26                   Ealing  Entire home/apt       47.0     9999.0   192.906552
27                   Ealing     Private room       10.0      900.0    68.745914
28                   Ealing      Shared room       22.0      169.0    51.833333
29                  Enfield  Entire home/apt       40.0     5240.0   178.147493
30                  Enfield       Hotel room       66.0      101.0    85.000000
31                  Enfield     Private room       18.0      380.0    60.092308
32                Greenwich  Entire home/apt       30.0     9999.0   203.837772
33                Greenwich     Private room       19.0      922.0    72.493069
34                Greenwich      Shared room       22.0       63.0    41.250000
35                  Hackney  Entire home/apt       45.0     8000.0   189.768032
36                  Hackney       Hotel room       46.0      290.0   170.333333
37                  Hackney     Private room       25.0     7448.0    91.663784
38                  Hackney      Shared room       57.0       57.0    57.000000
39   Hammersmith and Fulham  Entire home/apt       11.0    10032.0   231.149050
40   Hammersmith and Fulham       Hotel room       19.0      186.0    84.250000
41   Hammersmith and Fulham     Private room       19.0     1800.0    93.469218
42   Hammersmith and Fulham      Shared room       18.0      101.0    33.571429
43                 Haringey  Entire home/apt       40.0     6924.0   183.053118
44                 Haringey     Private room       16.0     4002.0    78.802251
45                 Haringey      Shared room       27.0      152.0    87.555556
46                   Harrow  Entire home/apt       35.0     1800.0   149.609195
47                   Harrow     Private room       23.0      263.0    56.296482
48                   Harrow      Shared room       23.0       77.0    59.000000
49                 Havering  Entire home/apt       36.0     9999.0   228.991632
50                 Havering     Private room       21.0      810.0    56.612565
51               Hillingdon  Entire home/apt       36.0     3300.0   174.091837
52               Hillingdon     Private room       12.0      525.0    62.673810
53                 Hounslow  Entire home/apt       37.0     9999.0   200.876686
54                 Hounslow       Hotel room        NaN        NaN          NaN
55                 Hounslow     Private room       13.0     4332.0    79.045213
56                 Hounslow      Shared room       46.0       55.0    50.500000
57                Islington  Entire home/apt       47.0    74100.0   255.522681
58                Islington       Hotel room      114.0      114.0   114.000000
59                Islington     Private room       24.0     8480.0   119.958495
60                Islington      Shared room        NaN        NaN          NaN
61   Kensington and Chelsea  Entire home/apt       36.0     9999.0   341.586093
62   Kensington and Chelsea       Hotel room      133.0     7377.0   998.100000
63   Kensington and Chelsea     Private room       31.0    53588.0   268.433333
64   Kensington and Chelsea      Shared room       24.0     1000.0   130.300000
65     Kingston upon Thames  Entire home/apt       49.0     1035.0   184.572391
66     Kingston upon Thames     Private room       24.0      285.0    65.526596
67                  Lambeth  Entire home/apt       35.0     9999.0   210.757194
68                  Lambeth     Private room       10.0    66189.0   543.620750
69                  Lambeth      Shared room       27.0       30.0    29.000000
70                 Lewisham  Entire home/apt       21.0     5000.0   153.702673
71                 Lewisham     Private room       18.0     6523.0    76.995283
72                 Lewisham      Shared room       20.0       60.0    34.100000
73                   Merton  Entire home/apt       33.0     1200.0   197.013962
74                   Merton     Private room       20.0      980.0    77.624365
75                   Merton      Shared room       75.0       75.0    75.000000
76                   Newham  Entire home/apt       49.0     9999.0   201.878571
77                   Newham       Hotel room      253.0      275.0   264.000000
78                   Newham     Private room       19.0     6000.0    85.618619
79                   Newham      Shared room       24.0       70.0    46.000000
80                Redbridge  Entire home/apt       43.0     1176.0   195.818182
81                Redbridge     Private room        8.0     4750.0    71.962025
82                Redbridge      Shared room       28.0       28.0    28.000000
83     Richmond upon Thames  Entire home/apt       35.0     2900.0   239.275926
84     Richmond upon Thames       Hotel room      301.0      301.0   301.000000
85     Richmond upon Thames     Private room       25.0      380.0    74.236162
86                Southwark  Entire home/apt       37.0     9999.0   214.305810
87                Southwark       Hotel room       41.0      198.0   119.500000
88                Southwark     Private room       21.0    10001.0   112.154896
89                Southwark      Shared room       29.0      108.0    46.375000
90                   Sutton  Entire home/apt        9.0      811.0   127.587940
91                   Sutton     Private room       24.0      750.0    59.548780
92            Tower Hamlets  Entire home/apt       10.0  1085147.0   617.237147
93            Tower Hamlets       Hotel room      180.0      180.0   180.000000
94            Tower Hamlets     Private room       21.0     8411.0    91.094063
95            Tower Hamlets      Shared room       22.0       80.0    45.000000
96           Waltham Forest  Entire home/apt       45.0     1929.0   157.795858
97           Waltham Forest     Private room       20.0      400.0    65.111324
98           Waltham Forest      Shared room        7.0      165.0    74.750000
99               Wandsworth  Entire home/apt       39.0    12000.0   249.390594
100              Wandsworth       Hotel room        NaN        NaN          NaN
101              Wandsworth     Private room       23.0     5000.0    94.308316
102              Wandsworth      Shared room       16.0      489.0   153.166667
103             Westminster  Entire home/apt       45.0    15143.0   373.588714
104             Westminster       Hotel room      188.0     1490.0  1088.454545
105             Westminster     Private room       18.0    10000.0   155.258842
106             Westminster      Shared room       13.0     1800.0   191.490566

In [257]:
#Number of reviews in the last 12 months and overall

reviews = (
                df.groupby(["name"])
                 .agg(reviews_ltm = ("number_of_reviews_ltm", "sum"), 
                      total_reviews=("number_of_reviews", "sum"))
                 .sort_values("reviews_ltm", ascending = False).reset_index()


)

reviews

                                              name  reviews_ltm  total_reviews
0              Design Studio in Tower Hill, London          390            478
1             Private Double Room in Warren Street          260           1144
2                             Double Room+ Ensuite          246           1902
3      West Kensington En Suite | Easy City Access          241            441
4                    Brick Lane | Private En-Suite          227            241
...                                            ...          ...            ...
93336          Lovely family home by Richmond Park            0              1
93337        Lovely family home close to Richmond.            0              3
93338   Lovely family home close to Wimbledon Park            0              0
93339                  Lovely family home in Acton            0              8
93340     Modern and cosy 1 bedroom flat in Fulham            0              4

[93341 rows x 3 columns]